RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_dma.h
/** @defgroup DMA_LL_EC_TRIGGER_SELECTION Trigger Selection
  * @{
  */
/* HPDMA1 triggers */
#define LL_HPDMA1_TRIGGER_DCMIPP_EVT_FRAMEEND              0U    /*!< HPDMA1 HW Trigger signal is DCMIPP_EVT_FRAMEEND  */
#define LL_HPDMA1_TRIGGER_DCMIPP_EVT_HSYNC                 1U    /*!< HPDMA1 HW Trigger signal is DCMIPP_EVT_HSYNC     */
#define LL_HPDMA1_TRIGGER_DCMIPP_EVT_LINEEND               2U    /*!< HPDMA1 HW Trigger signal is DCMIPP_EVT_LINEEND   */
#define LL_HPDMA1_TRIGGER_DCMIPP_EVT_VSYNC                 3U    /*!< HPDMA1 HW Trigger signal is DCMIPP_EVT_VSYNC     */
#define LL_HPDMA1_TRIGGER_DMA2D_CTC_FLAG                   4U    /*!< HPDMA1 HW Trigger signal is DMA2D_CTC_FLAG       */
#define LL_HPDMA1_TRIGGER_DMA2D_TC_FLAG                    5U    /*!< HPDMA1 HW Trigger signal is DMA2D_TC_FLAG        */
#define LL_HPDMA1_TRIGGER_DMA2D_TW_FLAG                    6U    /*!< HPDMA1 HW Trigger signal is DMA2D_TW_FLAG        */
#define LL_HPDMA1_TRIGGER_JPEG_EOC_FLAG                    7U    /*!< HPDMA1 HW Trigger signal is JPEG_EOC_FLAG        */
#define LL_HPDMA1_TRIGGER_JPEG_IFNF_FLAG                   8U    /*!< HPDMA1 HW Trigger signal is JPEG_IFNF_FLAG       */
#define LL_HPDMA1_TRIGGER_JPEG_IFT_FLAG                    9U    /*!< HPDMA1 HW Trigger signal is JPEG_IFT_FLAG        */
#define LL_HPDMA1_TRIGGER_JPEG_OFNE_FLAG                   10U   /*!< HPDMA1 HW Trigger signal is JPEG_OFNE_FLAG       */
#define LL_HPDMA1_TRIGGER_JPEG_OFT_FLAG                    11U   /*!< HPDMA1 HW Trigger signal is JPEG_OFT_FLAG        */
#define LL_HPDMA1_TRIGGER_LCD                              12U   /*!< HPDMA1 HW Trigger signal is LCD                  */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG0                  13U   /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_FLAG0      */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG1                  14U   /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_FLAG1      */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG2                  15U   /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_FLAG2      */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG3                  16U   /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_FLAG3      */
#define LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_4                   17U   /*!< HPDMA1 HW Trigger signal is GFXTIM_0_EVT_4       */
#define LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_3                   18U   /*!< HPDMA1 HW Trigger signal is GFXTIM_0_EVT_3       */
#define LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_2                   19U   /*!< HPDMA1 HW Trigger signal is GFXTIM_0_EVT_2       */
#define LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_1                   20U   /*!< HPDMA1 HW Trigger signal is GFXTIM_0_EVT_1       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH0_TCF                   21U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH0_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH1_TCF                   22U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH1_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH2_TCF                   23U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH2_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH3_TCF                   24U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH3_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH4_TCF                   25U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH4_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH5_TCF                   26U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH5_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH6_TCF                   27U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH6_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH7_TCF                   28U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH7_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH8_TCF                   29U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH8_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH9_TCF                   30U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH9_TCF       */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH10_TCF                  31U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH10_TCF      */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH11_TCF                  32U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH11_TCF      */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH12_TCF                  33U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH12_TCF      */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH13_TCF                  34U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH13_TCF      */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH14_TCF                  35U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH14_TCF      */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH15_TCF                  36U   /*!< HPDMA1 HW Trigger signal is GPDMA1_CH15_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH0_TCF                   37U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH0_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH1_TCF                   38U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH1_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH2_TCF                   39U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH2_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH3_TCF                   40U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH3_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH4_TCF                   41U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH4_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH5_TCF                   42U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH5_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH6_TCF                   43U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH6_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH7_TCF                   44U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH7_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH8_TCF                   45U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH8_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH9_TCF                   46U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH9_TCF       */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH10_TCF                  47U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH10_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH11_TCF                  48U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH11_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH12_TCF                  49U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH12_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH13_TCF                  50U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH13_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH14_TCF                  51U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH14_TCF      */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH15_TCF                  52U   /*!< HPDMA1 HW Trigger signal is HPDMA1_CH15_TCF      */

/* GPDMA1 triggers */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH0_TCF                   0U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH0_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH1_TCF                   1U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH1_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH2_TCF                   2U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH2_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH3_TCF                   3U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH3_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH4_TCF                   4U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH4_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH5_TCF                   5U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH5_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH6_TCF                   6U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH6_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH7_TCF                   7U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH7_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH8_TCF                   8U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH8_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH9_TCF                   9U   /*!< GPDMA1 HW Trigger signal is HPDMA1_CH9_TCF        */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH10_TCF                  10U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH10_TCF       */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH11_TCF                  11U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH11_TCF       */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH12_TCF                  12U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH12_TCF       */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH13_TCF                  13U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH13_TCF       */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH14_TCF                  14U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH14_TCF       */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH15_TCF                  15U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH15_TCF       */
#define LL_GPDMA1_TRIGGER_LPTIM1_CH1                       16U  /*!< GPDMA1 HW Trigger signal is LPTIM1_CH1            */
#define LL_GPDMA1_TRIGGER_LPTIM1_CH2                       17U  /*!< GPDMA1 HW Trigger signal is LPTIM1_CH2            */
#define LL_GPDMA1_TRIGGER_LPTIM2_CH1                       18U  /*!< GPDMA1 HW Trigger signal is LPTIM2_CH1            */
#define LL_GPDMA1_TRIGGER_LPTIM2_CH2                       19U  /*!< GPDMA1 HW Trigger signal is LPTIM2_CH2            */
#define LL_GPDMA1_TRIGGER_LPTIM3_CH1                       20U  /*!< GPDMA1 HW Trigger signal is LPTIM3_CH1            */
#define LL_GPDMA1_TRIGGER_LPTIM3_CH2                       21U  /*!< GPDMA1 HW Trigger signal is LPTIM3_CH2            */
#define LL_GPDMA1_TRIGGER_LPTIM4_OUT                       22U  /*!< GPDMA1 HW Trigger signal is LPTIM4_OUT            */
#define LL_GPDMA1_TRIGGER_LPTIM5_OUT                       23U  /*!< GPDMA1 HW Trigger signal is LPTIM5_OUT            */
#define LL_GPDMA1_TRIGGER_EXTIT0_SYNC                      24U  /*!< GPDMA1 HW Trigger signal is EXTIT0_SYNC           */
#define LL_GPDMA1_TRIGGER_RTC_WKUP                         25U  /*!< GPDMA1 HW Trigger signal is RTC_WKUP              */
#define LL_GPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC           26U  /*!< GPDMA1 HW Trigger signal is R_WUP_ASYNC           */
#define LL_GPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC           27U  /*!< GPDMA1 HW Trigger signal is T_WUP_ASYNC           */
#define LL_GPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC         28U  /*!< GPDMA1 HW Trigger signal is SPI6_OR_SPI6_AIT_SYNC */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH0_TCF                   29U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH1_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH1_TCF                   30U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH1_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH2_TCF                   31U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH2_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH3_TCF                   32U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH3_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH4_TCF                   33U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH4_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH5_TCF                   34U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH5_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH6_TCF                   35U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH6_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH7_TCF                   36U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH7_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH8_TCF                   37U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH8_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH9_TCF                   38U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH9_TCF        */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH10_TCF                  39U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH10_TCF       */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH11_TCF                  40U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH11_TCF       */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH12_TCF                  41U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH12_TCF       */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH13_TCF                  42U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH13_TCF       */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH14_TCF                  43U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH14_TCF       */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH15_TCF                  44U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH15_TCF       */
#define LL_GPDMA1_TRIGGER_TIM1_TRGO                        45U  /*!< GPDMA1 HW Trigger signal is TIM1_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM1_TRGO2                       46U  /*!< GPDMA1 HW Trigger signal is TIM1_TRGO2            */
#define LL_GPDMA1_TRIGGER_TIM2_TRGO                        47U  /*!< GPDMA1 HW Trigger signal is TIM2_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM3_TRGO                        48U  /*!< GPDMA1 HW Trigger signal is TIM3_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM4_TRGO                        49U  /*!< GPDMA1 HW Trigger signal is TIM4_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM5_TRGO                        50U  /*!< GPDMA1 HW Trigger signal is TIM5_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM6_TRGO                        51U  /*!< GPDMA1 HW Trigger signal is TIM6_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM7_TRGO                        52U  /*!< GPDMA1 HW Trigger signal is TIM7_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM9_TRGO                        53U  /*!< GPDMA1 HW Trigger signal is TIM9_TRGO             */
#define LL_GPDMA1_TRIGGER_TIM12_TRGO                       54U  /*!< GPDMA1 HW Trigger signal is TIM12_TRGO            */
#define LL_GPDMA1_TRIGGER_TIM15_TRGO                       55U  /*!< GPDMA1 HW Trigger signal is TIM15_TRGO            */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup DMA_LL_Exported_Macros DMA Exported Macros
  * @{
  */

/** @defgroup DMA_LL_EM_COMMON_WRITE_READ_REGISTERS Common Write and Read Registers macros
  * @{
  */
/**
  * @brief  Write a value in DMA register.
  * @param  __INSTANCE__ DMA Instance.
  * @param  __REG__      Register to be written.
  * @param  __VALUE__    Value to be written in the register.
  * @retval None.
  */
#define LL_DMA_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in DMA register.
  * @param  __INSTANCE__ DMA Instance.
  * @param  __REG__      Register to be read.
  * @retval Register value.
  */
#define LL_DMA_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup DMA_LL_EM_CONVERT_DMAxCHANNELy Convert DMAxChannely
  * @{
  */
/**
  * @brief  Convert DMAx_Channely into DMAx.
  * @param  __CHANNEL_INSTANCE__ DMAx_Channely.
  * @retval DMAx.
  */
#define LL_DMA_GET_INSTANCE(__CHANNEL_INSTANCE__) \
  (((uint32_t)(__CHANNEL_INSTANCE__) > ((uint32_t)GPDMA1_Channel15)) ?  HPDMA1 : GPDMA1)

/**
  * @brief  Convert DMAx_Channely into LL_DMA_CHANNEL_y.
  * @param  __CHANNEL_INSTANCE__ DMAx_Channely.
  * @retval LL_DMA_CHANNEL_y.
  */
#define LL_DMA_GET_CHANNEL(__CHANNEL_INSTANCE__) \
  (((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel0))  ? LL_DMA_CHANNEL_0  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel1))  ? LL_DMA_CHANNEL_1  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel2))  ? LL_DMA_CHANNEL_2  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel3))  ? LL_DMA_CHANNEL_3  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel4))  ? LL_DMA_CHANNEL_4  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel5))  ? LL_DMA_CHANNEL_5  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel6))  ? LL_DMA_CHANNEL_6  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel6))  ? LL_DMA_CHANNEL_6  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel7))  ? LL_DMA_CHANNEL_7  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel7))  ? LL_DMA_CHANNEL_7  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel8))  ? LL_DMA_CHANNEL_8  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel8))  ? LL_DMA_CHANNEL_8  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel9))  ? LL_DMA_CHANNEL_9  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel9))  ? LL_DMA_CHANNEL_9  : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel10)) ? LL_DMA_CHANNEL_10 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel10)) ? LL_DMA_CHANNEL_10 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel11)) ? LL_DMA_CHANNEL_11 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel11)) ? LL_DMA_CHANNEL_11 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel12)) ? LL_DMA_CHANNEL_12 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel12)) ? LL_DMA_CHANNEL_12 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel13)) ? LL_DMA_CHANNEL_13 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel13)) ? LL_DMA_CHANNEL_13 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)HPDMA1_Channel14)) ? LL_DMA_CHANNEL_14 : \
   ((uint32_t)(__CHANNEL_INSTANCE__) == ((uint32_t)GPDMA1_Channel14)) ? LL_DMA_CHANNEL_14 : \
   LL_DMA_CHANNEL_15)

