RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_dma.h
/**
  * @brief Set hardware request.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         REQSEL     LL_DMA_SetPeriphRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @param  Request This parameter can be one of the following values:
  *         @arg @ref LL_HPDMA1_REQUEST_JPEG_RX
  *         @arg @ref LL_HPDMA1_REQUEST_JPEG_TX
  *         @arg @ref LL_HPDMA1_REQUEST_XSPI1
  *         @arg @ref LL_HPDMA1_REQUEST_XSPI2
  *         @arg @ref LL_HPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI3_TX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI4_RX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI4_TX
  *         @arg @ref LL_HPDMA1_REQUEST_ADC1
  *         @arg @ref LL_HPDMA1_REQUEST_ADC2
  *         @arg @ref LL_HPDMA1_REQUEST_ADF1_FLT0
  *         @arg @ref LL_HPDMA1_REQUEST_UART4_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART4_TX
  *         @arg @ref LL_HPDMA1_REQUEST_UART5_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART5_TX
  *         @arg @ref LL_HPDMA1_REQUEST_UART7_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART7_TX
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA1_REQUEST_ADC1
  *         @arg @ref LL_GPDMA1_REQUEST_ADC2
  *         @arg @ref LL_GPDMA1_REQUEST_CRYP_IN
  *         @arg @ref LL_GPDMA1_REQUEST_CRYP_OUT
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_IN
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_OUT
  *         @arg @ref LL_GPDMA1_REQUEST_HASH_IN
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM6_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM7_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_COM
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_A
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_B
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_A
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_B
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_TX
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_READ
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_WRITE
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_UE
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA1_REQUEST_SPDIF_RX_DT
  *         @arg @ref LL_GPDMA1_REQUEST_SPDIF_RX_CS
  *         @arg @ref LL_GPDMA1_REQUEST_ADF1_FLT0
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_PSSI
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_UE
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TC
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RS
  * @retval None.
  */
__STATIC_INLINE void LL_DMA_SetPeriphRequest(const DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Request)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  MODIFY_REG(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_REQSEL, Request);
}

/**
  * @brief  Get hardware request.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         REQSEL     LL_DMA_GetPeriphRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_HPDMA1_REQUEST_JPEG_RX
  *         @arg @ref LL_HPDMA1_REQUEST_JPEG_TX
  *         @arg @ref LL_HPDMA1_REQUEST_XSPI1
  *         @arg @ref LL_HPDMA1_REQUEST_XSPI2
  *         @arg @ref LL_HPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI3_TX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI4_RX
  *         @arg @ref LL_HPDMA1_REQUEST_SPI4_TX
  *         @arg @ref LL_HPDMA1_REQUEST_ADC1
  *         @arg @ref LL_HPDMA1_REQUEST_ADC2
  *         @arg @ref LL_HPDMA1_REQUEST_ADF1_FLT0
  *         @arg @ref LL_HPDMA1_REQUEST_UART4_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART4_TX
  *         @arg @ref LL_HPDMA1_REQUEST_UART5_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART5_TX
  *         @arg @ref LL_HPDMA1_REQUEST_UART7_RX
  *         @arg @ref LL_HPDMA1_REQUEST_UART7_TX
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_HPDMA1_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA1_REQUEST_ADC1
  *         @arg @ref LL_GPDMA1_REQUEST_ADC2
  *         @arg @ref LL_GPDMA1_REQUEST_CRYP_IN
  *         @arg @ref LL_GPDMA1_REQUEST_CRYP_OUT
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_IN
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_OUT
  *         @arg @ref LL_GPDMA1_REQUEST_HASH_IN
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM6_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM7_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_COM
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_A
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_B
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_A
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_B
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_RX
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_TX
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_READ
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_WRITE
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_UE
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA1_REQUEST_SPDIF_RX_DT
  *         @arg @ref LL_GPDMA1_REQUEST_SPDIF_RX_CS
  *         @arg @ref LL_GPDMA1_REQUEST_ADF1_FLT0
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_PSSI
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_UE
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TC
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RS
  */
__STATIC_INLINE  uint32_t LL_DMA_GetPeriphRequest(const DMA_TypeDef *DMAx, uint32_t Channel)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  return (READ_BIT(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_REQSEL));
}

/**
  * @brief Set hardware trigger.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         TRIGSEL     LL_DMA_SetHWTrigger
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_EVT_FRAMEEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_EVT_HSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_EVT_LINEEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_EVT_VSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_CTC_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_TC_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_TW_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_EOC_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_IFNF_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_IFT_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_OFNE_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_OFT_FLAG
  *         @arg @ref LL_HPDMA1_TRIGGER_LCD
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG0
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG1
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG2
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_FLAG3
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_4
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_3
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_2
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_0_EVT_1
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH8_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH9_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH10_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH11_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH12_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH13_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH14_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH15_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH0_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH1_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH2_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH3_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH4_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH5_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH6_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH7_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH8_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH9_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH10_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH11_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH12_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH13_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH14_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH15_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH8_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH9_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH10_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH11_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH12_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH13_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH14_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH15_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM4_OUT
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_OUT
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT0_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_RTC_WKUP
  *         @arg @ref LL_GPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH8_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH9_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH10_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH11_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH12_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH13_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH14_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH15_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM1_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM1_TRGO2
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM3_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM4_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM5_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM6_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM7_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM9_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM15_TRGO
  * @retval None.
  */
__STATIC_INLINE void LL_DMA_SetHWTrigger(const DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Trigger)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  MODIFY_REG(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_TRIGSEL,
             (Trigger << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL);
}

